brew "ansible-lint"
brew "ansible"
brew "bash-completion"
brew "curl"
brew "dive"
brew "exa"
brew "git"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "graphviz"
brew "helm"
brew "homebrew/core/python"
brew "jq"
brew "krew"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "mkcert"
brew "nats-io/nats-tools/nats"
brew "neovim"
brew "nmap"
brew "homebrew/core/node"
brew "php"
brew "pnpm"
brew "protobuf"
brew "tldr"
brew "yarn"
brew "yq"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"

cask_args appdir: "/Applications"
cask "cleanmymac"
cask "google-drive"
cask "homebrew/cask-fonts/font-fira-code"
cask "insomnia"
cask "iterm2"
cask "linear-linear"
cask "orbstack"
cask "raycast"
cask "slack"
cask "visual-studio-code"
