# This file was generated by 'generate_brewfile.zsh'.

tap "mergifyio/tap"
tap "nats-io/nats-tools"

brew "actionlint"
brew "ansible"
brew "ansible-lint"
brew "bash-completion"
brew "bat"
brew "biome"
brew "cloud-sql-proxy"
brew "coreutils"
brew "curl"
brew "dive"
brew "eza"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "grep"
brew "helm"
brew "jq"
brew "krew"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "libb2"
brew "libpq"
brew "luarocks"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openssl@3"
brew "overmind"
brew "pgformatter"
brew "php"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "postgresql@15"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "pyright"
brew "python@3.13"
brew "readline"
brew "ripgrep"
brew "ruby"
brew "semgrep"
brew "shellcheck"
brew "sqlite"
brew "tcl-tk@8"
brew "uv"
brew "xz"
brew "yarn"
brew "yq"
brew "z"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "mergifyio/tap/mergify-cli"

cask_args appdir: "/Applications"
cask "bruno"
cask "claude"
cask "discord"
cask "figma"
cask "firefox@developer-edition"
cask "font-fira-code"
cask "gcloud-cli"
cask "iterm2"
cask "linear"
cask "linear-linear"
cask "loom"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
cask "visual-studio-code"
