brew "ansible-lint"
brew "ansible"
brew "bash-completion"
brew "bat"
brew "curl"
brew "dive"
brew "eza"
brew "fzf"
brew "git"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "graphviz"
brew "helm"
brew "homebrew/core/node"
brew "homebrew/core/python"
brew "jq"
brew "krew"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "luarocks"
brew "mkcert"
brew "nats-io/nats-tools/nats"
brew "neovim"
brew "nmap"
brew "php"
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "tldr"
brew "yarn"
brew "yq"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"

# https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk@8"
brew "libb2"

cask_args appdir: "/Applications"
cask "bruno"
cask "cleanmymac"
cask "homebrew/cask-fonts/font-fira-code"
cask "iterm2"
cask "linear-linear"
cask "orbstack"
cask "raycast"
cask "slack"
cask "visual-studio-code"
